# Preprocessing Toyota.csv

BI session: 01/02/2023

In [2]:
import pandas as pd

### Reading data from the csv file

In [3]:
cars_data = pd.read_csv("Toyota.csv")
cars_data.head()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170

In [4]:
cars_data.describe()

,Unnamed: 0,Price,Age,MetColor,Automatic,CC,Weight
count,1436.000000,1436.000000,1336.000000,1286.000000,1436.000000,1436.000000,1436.00000
mean,717.500000,10730.824513,55.672156,0.674961,0.055710,1566.827994,1072.45961
std,414.681806,3626.964585,18.589804,0.468572,0.229441,187.182436,52.64112
min,0.000000,4350.000000,1.000000,0.000000,0.000000,1300.000000,1000.00000
25%,358.750000,8450.000000,43.000000,0.000000,0.000000,1400.000000,1040.00000
50%,717.500000,9900.000000,60.000000,1.000000,0.000000,1600.000000,1070.00000
75%,1076.250000,11950.000000,70.000000,1.000000,0.000000,1600.000000,1085.00000
max,1435.000000,32500.000000,80.000000,1.000000,1.000000,2000.000000,1615.00000

### Checking the number of null values in each column

In [5]:
cars_data.isna().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [7]:
cars_data = pd.read_csv("Toyota.csv", na_values = ["??", "????"])
cars_data.head()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
3,3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170

In [8]:
cars_data.isna().sum()

Unnamed: 0      0
Price           0
Age           100
KM             15
FuelType      100
HP              6
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

### Replacing null values in 'Age' column

In [9]:
a = cars_data['Age'].mean()
print(a)

55.67215568862275

In [10]:
cars_data['Age'].fillna(a, inplace = True)

In [11]:
cars_data.isna().sum()

Unnamed: 0      0
Price           0
Age             0
KM             15
FuelType      100
HP              6
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

### Replacing null values in 'KM' column

In [12]:
b = cars_data['KM'].median()
print(b)

63634.0

In [13]:
cars_data['KM'].fillna(b, inplace = True)

In [25]:
cars_data.isna().sum()

Unnamed: 0    0
Price         0
Age           0
KM            0
FuelType      0
HP            0
MetColor      0
Automatic     0
CC            0
Doors         0
Weight        0
dtype: int64

### Replacing null values in 'FuelType' column

In [15]:
c = cars_data['FuelType'].value_counts()
print(c)

Petrol    1177
Diesel     144
CNG         15
Name: FuelType, dtype: int64

In [16]:
cars_data['FuelType'].fillna(c.index[0], inplace = True)

In [17]:
cars_data.isna().sum()

Unnamed: 0      0
Price           0
Age             0
KM              0
FuelType        0
HP              6
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

### Replacing null values in 'MetColor' column

In [18]:
d = cars_data['MetColor'].mode()
print(d)

0    1.0
Name: MetColor, dtype: float64

In [19]:
cars_data['MetColor'].fillna(d.index[0], inplace = True)

In [20]:
cars_data.isna().sum()

Unnamed: 0    0
Price         0
Age           0
KM            0
FuelType      0
HP            6
MetColor      0
Automatic     0
CC            0
Doors         0
Weight        0
dtype: int64

### Replacing null values in 'HP' column

In [21]:
e = cars_data['HP'].mean()
print(e)

101.47832167832168

In [22]:
cars_data['HP'].fillna(e, inplace = True)

In [23]:
cars_data.isna().sum()

Unnamed: 0    0
Price         0
Age           0
KM            0
FuelType      0
HP            0
MetColor      0
Automatic     0
CC            0
Doors         0
Weight        0
dtype: int64

# Preprocessing Completed!